SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
/*
 * Copyright (c) 2026 Silicon Laboratories Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <stdbool.h>
#define DT_DRV_COMPAT silabs_efr32_usart_i2s

#include <errno.h>
#include <string.h>

#include <zephyr/device.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/clock_control_silabs.h>
#include <zephyr/drivers/dma.h>
#include <zephyr/drivers/dma/dma_silabs_ldma.h>
#include <zephyr/drivers/i2s.h>
#include <zephyr/drivers/pinctrl.h>
#include <zephyr/irq.h>
#include <zephyr/kernel.h>
#include <zephyr/sys/time_units.h>
#include <zephyr/sys/util.h>

#include <em_usart.h>
#include <soc.h>

#if IS_ENABLED(CONFIG_CLOCK_SILABS_EFR32_MCO)
#include <zephyr/drivers/clock_control/clock_silabs_efr32_mco.h>
#endif

#define SUPPORTED_OPTIONS                                                           \
  (I2S_OPT_BIT_CLK_CONTROLLER | I2S_OPT_FRAME_CLK_CONTROLLER | I2S_OPT_BIT_CLK_CONT \
   | I2S_OPT_BIT_CLK_GATED)

#define TX_RING_SIZE CONFIG_I2S_SILABS_EFR32_USART_TX_BLOCK_COUNT
#define RX_RING_SIZE CONFIG_I2S_SILABS_EFR32_USART_RX_BLOCK_COUNT
#define I2S_RING_CAP MAX(TX_RING_SIZE, RX_RING_SIZE)

/* Stereo: every LRCLK frame carries L + R = 2 channel slots. */
#define I2S_STEREO_SLOTS_PER_FRAME 2U

/* Conversion from word_size (bits) to bytes per slot. */
#define I2S_BITS_PER_BYTE 8U

/*
 * Minimum sample rate accepted by configure().  Below 8 kHz the producer-side
 * timing tolerance shrinks and the LDMA TXBL trigger latency dominates audio
 * quality.  Most I2S codecs (e.g. TAS2505) also spec >= 8 kHz.
 */
#define I2S_MIN_FRAME_CLK_HZ 8000U

/*
 * LDMA channel priority (0 = highest, 3 = lowest in the Silabs LDMA driver).
 * I2S TX must keep up with the codec but other DMA users (UART console,
 * crypto, etc.) typically have shorter deadlines, so I2S sits at the lowest
 * priority slot.
 */
#define I2S_DMA_CHANNEL_PRIORITY 3U

/*
 * Boolean for dma_config.complete_callback_en (1 = invoke dma_callback on
 * each block completion -- required for our gapless append/chain logic).
 */
#define I2S_DMA_COMPLETE_CB_ENABLED 1U

/*
 * EFR32 USART I2S driver (stereo and mono TX).
 *
 * The hardware always emits two channel slots per LRCLK frame on the wire.
 *
 * USART DMA request naming (RM / SoC headers):
 *   TXBL      = Transmit Buffer Level (NOT "left"). Fires when the TX FIFO has
 *               space for another sample. With I2SCTRL.DMASPLIT=0 it requests
 *               one LDMA move for the next word(s) on the bus (stereo: L+R).
 *   TXBLRIGHT = Separate DMA request when DMASPLIT=1; targets the right I2S
 *               slot only. The "RIGHT" suffix is explicit; TXBL itself is not
 *               an abbreviation for "TX buffer left".
 *
 * Stereo (configure channels == 2, I2SCTRL.DMASPLIT = 0):
 *   One LDMA channel on USARTnTXBL writes interleaved L/R samples to
 *   USARTn_TXDOUBLE. Buffer: [L0, R0, L1, R1, ...].
 *
 * Mono TX (configure channels == 1, I2SCTRL.DMASPLIT = 1):
 *   Two LDMA channels (devicetree "txbl" + "txblright"):
 *     - USARTnTXBL:      coincidentally the LRCLK-low / left wire slot
 *     - USARTnTXBLRIGHT: LRCLK-high / right wire slot
 *   Slot assignment comes from silabs,mono-tx-slot (default right).
 *   Application buffer: [M0, M1, ...] (one sample per LRCLK frame).
 *   I2SCTRL.MONO stays 0; LRCLK still toggles L/R on the bus.
 *
 * With DATABITS=16, USARTn_TXDATA loads only 8 FIFO bits per write; a full
 * I2S slot needs USARTn_TXDOUBLE (see RM §22.3.2.6 / §22.3.2.19). Stereo
 * and mono TX both target TXDOUBLE; mono moves one slot per DMA trigger.
 *
 * LDMA transfer size (I2S_DMA_DATA_SIZE):
 *   word_size 16 -> 2 bytes/trigger (one W16D16 slot)
 *   word_size 32 -> 4 bytes/trigger (one W32D16 slot; payload in low 16 bits)
 */
#define I2S_DMA_DATA_SIZE(word_size) (((uint32_t)(word_size)) == 16U ? 2U : 4U)

enum i2s_efr32_mono_tx_slot {
  I2S_EFR32_MONO_TX_SLOT_LEFT = 0,
  I2S_EFR32_MONO_TX_SLOT_RIGHT = 1,
};

struct i2s_efr32_ring {
  struct {
    void *blk;
    size_t len;
  } items[I2S_RING_CAP];
  uint16_t head;
  uint16_t tail;
  uint16_t count;
  uint16_t cap;
};

struct i2s_efr32_dma {
  const struct device *dma_dev;
  int channel;
  struct dma_config dma_cfg;
  struct dma_block_config blk_cfg;
  bool busy;
};

struct i2s_efr32_cfg {
  USART_TypeDef *base;
  const struct device *clock_dev;
  struct silabs_clock_control_cmu_config clock_cfg;
  const struct pinctrl_dev_config *pcfg;
  void (*irq_connect)(const struct device *dev);
  const struct device *dma_dev;
  uint32_t dma_txbl_slot;      /* LDMA slot: USARTnTXBL (buffer level, not "left") */
  uint32_t dma_txblright_slot; /* LDMA slot: USARTnTXBLRIGHT (mono DMASPLIT only) */
  uint32_t dma_rx_slot;
  const struct device *mclk_dev;
  bool has_tx_split;
  uint8_t mono_tx_default;
};

 #if IS_ENABLED(CONFIG_CLOCK_SILABS_EFR32_MCO)
static int i2s_efr32_mco_set(const struct device *mclk, bool enable)
{
  if (mclk == NULL) {
    return 0;
  }

  return enable ? silabs_mco_enable(mclk) : silabs_mco_disable(mclk);
}
 #else
static int i2s_efr32_mco_set(const struct device *mclk, bool enable)
{
  ARG_UNUSED(mclk);
  ARG_UNUSED(enable);

  return 0;
}
 #endif

struct i2s_efr32_stream {
  int32_t state;
  bool cfg_valid;
  struct i2s_config cfg;
  struct i2s_efr32_ring q;
  void *active;
  void *pending;
  struct i2s_efr32_dma dma;
  struct k_sem sem;
};

struct i2s_efr32_data {
  struct i2s_efr32_stream tx;
  struct i2s_efr32_stream rx;
  struct i2s_efr32_dma tx_silence;
  int16_t silence_16;
  int32_t silence_32;
  uint8_t mono_tx_slot;
  struct k_mutex cfg_lock;
};

static void i2s_efr32_isr(const void *arg);
static void i2s_efr32_tx_try_start(const struct device *dev);
static void i2s_efr32_rx_try_start(const struct device *dev);
static inline bool tx_path_is_mono(const struct i2s_efr32_data *data);

static void tx_finish_stopping_if_quiescent(const struct device *dev)
{
  const struct i2s_efr32_cfg *cfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  struct i2s_efr32_stream *tx = &data->tx;

  if (tx->state != I2S_STATE_STOPPING) {
    return;
  }
  if (tx->active != NULL || tx->pending != NULL || tx->q.count != 0U) {
    return;
  }
  /*
   * With gapless LDMA chaining, tx->active may already be NULL while the
   * channel is still marked busy until the final block completes.  If the
   * queue is empty, force the channel idle so STOPPING cannot wedge.
   */
  if (tx->dma.busy) {
    dma_stop(tx->dma.dma_dev, (uint32_t)tx->dma.channel);
    tx->dma.busy = false;
  }
  if (tx_path_is_mono(data) && data->tx_silence.busy) {
    dma_stop(cfg->dma_dev, (uint32_t)data->tx_silence.channel);
    data->tx_silence.busy = false;
  }
  tx->state = I2S_STATE_READY;
}

static void ring_init(struct i2s_efr32_ring *r, uint16_t capacity)
{
  r->head = 0U;
  r->tail = 0U;
  r->count = 0U;
  r->cap = capacity;
}

static int ring_push(struct i2s_efr32_ring *r, void *blk, size_t len)
{
  if (r->count >= r->cap) {
    return -ENOMEM;
  }
  r->items[r->head].blk = blk;
  r->items[r->head].len = len;
  r->head = (r->head + 1U) % r->cap;
  r->count++;
  return 0;
}

static int ring_pop(struct i2s_efr32_ring *r, void **blk, size_t *len)
{
  if (r->count == 0U) {
    return -ENOENT;
  }
  *blk = r->items[r->tail].blk;
  *len = r->items[r->tail].len;
  r->tail = (r->tail + 1U) % r->cap;
  r->count--;
  return 0;
}

static inline void apply_dma_xfer_size(struct dma_config *dma_cfg,
                                       uint8_t word_size)
{
  const uint32_t xfer = I2S_DMA_DATA_SIZE(word_size);
  dma_cfg->dest_data_size = xfer;
  dma_cfg->source_data_size = xfer;
  dma_cfg->source_burst_length = xfer;
  dma_cfg->dest_burst_length = xfer;
}

static inline bool tx_cfg_is_mono(const struct i2s_config *cfg)
{
  return cfg->channels == 1U;
}

static inline bool tx_path_is_mono(const struct i2s_efr32_data *data)
{
  return data->tx.cfg_valid && tx_cfg_is_mono(&data->tx.cfg);
}

static uintptr_t tx_silence_src(const struct i2s_efr32_data *data, uint8_t word_size)
{
  if (word_size == 32U) {
    return (uintptr_t)&data->silence_32;
  }
  return (uintptr_t)&data->silence_16;
}

static void tx_dma_apply_stereo(struct i2s_efr32_data *data, USART_TypeDef *base,
                                const struct i2s_efr32_cfg *pcfg, uint8_t word_size)
{
  apply_dma_xfer_size(&data->tx.dma.dma_cfg, word_size);
  /*
   * DMASPLIT=0: USARTnTXBL (Transmit Buffer Level) triggers one LDMA move for
   * interleaved L+R — not the left channel alone.
   */
  data->tx.dma.dma_cfg.dma_slot = pcfg->dma_txbl_slot;
  data->tx.dma.blk_cfg.dest_address = (uintptr_t)&base->TXDOUBLE;
  data->tx.dma.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
  data->tx.dma.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
}

static void tx_dma_apply_mono(struct i2s_efr32_data *data, USART_TypeDef *base,
                              const struct i2s_efr32_cfg *pcfg, uint8_t word_size)
{
  const bool audio_on_txbl = (data->mono_tx_slot == I2S_EFR32_MONO_TX_SLOT_LEFT);
  const uint32_t audio_slot = audio_on_txbl ? pcfg->dma_txbl_slot : pcfg->dma_txblright_slot;
  const uint32_t pad_slot = audio_on_txbl ? pcfg->dma_txblright_slot : pcfg->dma_txbl_slot;

  apply_dma_xfer_size(&data->tx.dma.dma_cfg, word_size);
  apply_dma_xfer_size(&data->tx_silence.dma_cfg, word_size);

  data->tx.dma.dma_cfg.dma_slot = audio_slot;
  data->tx.dma.blk_cfg.dest_address = (uintptr_t)&base->TXDOUBLE;
  data->tx.dma.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
  data->tx.dma.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;

  data->tx_silence.dma_cfg.dma_slot = pad_slot;
  data->tx_silence.blk_cfg.dest_address = (uintptr_t)&base->TXDOUBLE;
  data->tx_silence.blk_cfg.source_address = tx_silence_src(data, word_size);
  data->tx_silence.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
  data->tx_silence.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
  data->tx_silence.blk_cfg.block_size = I2S_DMA_DATA_SIZE(word_size);
}

static void hw_disable_data_irqs(USART_TypeDef *base)
{
  USART_IntDisable(base, USART_IF_TXBL | USART_IF_RXDATAV);
  USART_IntClear(base, USART_IF_TXBL | USART_IF_RXDATAV);
}

static void hw_clear_error_irqs(USART_TypeDef *base)
{
  USART_IntDisable(base, USART_IF_RXOF | USART_IF_TXUF);
  USART_IntClear(base, USART_IF_RXOF | USART_IF_TXUF);
}

