SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
/*
 * Compute USART CLKDIV for sync (I2S) mode with fractional precision.
 *
 * emlib USART_BaudrateSyncSet() only programs the integer divider
 * (clkdiv = (ref/(2*br)) << 8), which leaves the fractional sub-field at 0.
 *
 * RM: br = (128 * ref) / (256 + CLKDIV)  =>  CLKDIV = round(128*ref/br) - 256
 *
 * Returns 0 and stores the divider in *clkdiv_out on success, or -EINVAL when
 * ref_hz or baud_hz is zero (no valid divider).
 */
static int i2s_efr32_sync_clkdiv(uint32_t ref_hz, uint32_t baud_hz, uint32_t *clkdiv_out)
{
  uint64_t clkdiv;

  if (ref_hz == 0U || baud_hz == 0U) {
    return -EINVAL;
  }

  clkdiv = ((uint64_t)128U * ref_hz
            + (uint64_t)baud_hz / 2U) / (uint64_t)baud_hz;

  if (clkdiv < 256U) {
    clkdiv = 256U;
  }
  clkdiv -= 256U;

#if defined(_USART_CLKDIV_DIVEXT_MASK)
  *clkdiv_out = (uint32_t)(clkdiv
                           & (_USART_CLKDIV_DIV_MASK | _USART_CLKDIV_DIVEXT_MASK));
#else
  *clkdiv_out = (uint32_t)(clkdiv & _USART_CLKDIV_DIV_MASK);
#endif
  return 0;
}

static int validate_i2s_config(const struct i2s_efr32_cfg *pcfg,
                               const struct i2s_efr32_data *data,
                               const struct i2s_config **out_ic,
                               uint32_t *ref_hz)
{
  int err;

  if (!data->tx.cfg_valid && !data->rx.cfg_valid) {
    return -EINVAL;
  }

  err = clock_control_get_rate(pcfg->clock_dev,
                               (clock_control_subsys_t)(uintptr_t)&pcfg->clock_cfg, ref_hz);
  if (err < 0) {
    return err;
  }
  if (*ref_hz == 0U) {
    return -EINVAL;
  }

  const struct i2s_config *ic = data->tx.cfg_valid ? &data->tx.cfg : &data->rx.cfg;

  if ((ic->options & SUPPORTED_OPTIONS) != ic->options) {
    return -EINVAL;
  }
  if ((ic->options & I2S_OPT_BIT_CLK_TARGET) || (ic->options & I2S_OPT_FRAME_CLK_TARGET)) {
    return -EINVAL;
  }
  /* USART I2S supports DATABITS=16 only; expose 16- and 32-bit slots via
   * usartI2sFormatW16D16 / W32D16 (16-bit data padded to 32-bit slot).
   */
  if (ic->word_size != 16U && ic->word_size != 32U) {
    return -EINVAL;
  }
  if (ic->frame_clk_freq < I2S_MIN_FRAME_CLK_HZ) {
    return -EINVAL;
  }
  if (ic->channels != 1U && ic->channels != 2U) {
    return -EINVAL;
  }

  switch (ic->format & I2S_FMT_DATA_FORMAT_MASK) {
    case I2S_FMT_DATA_FORMAT_I2S:
    case I2S_FMT_DATA_FORMAT_LEFT_JUSTIFIED:
      break;
    default:
      return -EINVAL;
  }

  *out_ic = ic;
  return 0;
}

static int hw_i2s_apply(const struct device *dev)
{
  const struct i2s_efr32_cfg *pcfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  const struct i2s_config *ic;
  USART_InitI2s_TypeDef init = USART_INITI2S_DEFAULT;
  uint32_t ref_hz = 0;
  uint32_t bit_hz;
  int err;

  err = validate_i2s_config(pcfg, data, &ic, &ref_hz);
  if (err < 0) {
    return err;
  }

  /*
   * Required physical SCLK (bit clock):
   *
   *   bit_hz = frame_clk_freq * SLOTS_PER_FRAME * word_size
   *
   * SLOTS_PER_FRAME is hard-wired to 2 (stereo) -- every LRCLK period
   * carries L + R, each `word_size` bits wide. Mono is the application's
   * job (duplicate sample into both slots).
   *
   * Example: frame_clk=16 kHz, word_size=16  -> bit_hz = 16k*2*16 = 512 kHz.
   *          frame_clk=48 kHz, word_size=32  -> bit_hz = 48k*2*32 = 3.072 MHz.
   *
   * Fed to emlib via init.sync.baudrate; emlib computes CLKDIV from
   * HFPERCLK and produces SCLK == bit_hz on the wire.
   */
  bit_hz = ic->frame_clk_freq * I2S_STEREO_SLOTS_PER_FRAME
           * (uint32_t)ic->word_size;

  apply_dma_xfer_size(&data->rx.dma.dma_cfg, ic->word_size);

  if (data->tx.cfg_valid) {
    if (tx_cfg_is_mono(&data->tx.cfg)) {
      tx_dma_apply_mono(data, pcfg->base, pcfg, ic->word_size);
    } else {
      tx_dma_apply_stereo(data, pcfg->base, pcfg, ic->word_size);
    }
  }

  hw_disable_data_irqs(pcfg->base);

  init.sync.refFreq = ref_hz;
  init.sync.baudrate = bit_hz;
  init.sync.databits = usartDatabits16;
  init.sync.master = true;
  init.sync.msbf = true;
  init.sync.clockMode =
    ((ic->format & I2S_FMT_CLK_FORMAT_MASK) == I2S_FMT_CLK_NF_IB)
    || ((ic->format & I2S_FMT_CLK_FORMAT_MASK) == I2S_FMT_CLK_IF_IB)
    ? usartClockMode1
    : usartClockMode0;
  switch (ic->word_size) {
    case 16U:
      init.format = usartI2sFormatW16D16;
      break;
    case 32U:
      init.format = usartI2sFormatW32D16;
      break;
    default:
      return -EINVAL;
  }
  init.justify = usartI2sJustifyLeft;
  /*
   * Wire format stays stereo (MONO=0): LRCLK toggles L/R. Mono TX uses
   * DMASPLIT + dual LDMA (samples on one slot, silence on the other).
   */
  init.mono = false;
  init.dmaSplit = data->tx.cfg_valid && tx_cfg_is_mono(&data->tx.cfg);

  if ((ic->format & I2S_FMT_DATA_FORMAT_MASK) == I2S_FMT_DATA_FORMAT_I2S) {
    init.delay = true;
  } else {
    init.delay = false;
  }

  init.sync.enable = usartDisable;

  USART_InitI2s(pcfg->base, &init);

  /*
   * Override emlib integer-only CLKDIV so BCLK matches bit_hz as closely
   * as the USART fractional divider allows. Only apply the override if
   * i2s_efr32_sync_clkdiv() returns a valid value; otherwise keep the
   * divider USART_InitI2s() programmed.
   */
  {
    uint32_t clkdiv;

    if (i2s_efr32_sync_clkdiv(ref_hz, bit_hz, &clkdiv) == 0) {
      pcfg->base->CLKDIV = clkdiv;
    }
  }

  if (data->tx.cfg_valid && data->rx.cfg_valid) {
    USART_Enable(pcfg->base, usartEnable);
  } else if (data->tx.cfg_valid) {
    USART_Enable(pcfg->base, usartEnableTx);
  } else {
    USART_Enable(pcfg->base, usartEnableRx);
  }

  {
    uint32_t interrupt_enable = 0U;

    if (data->tx.cfg_valid) {
      interrupt_enable |= USART_IF_TXUF;
    }
    if (data->rx.cfg_valid) {
      interrupt_enable |= USART_IF_RXOF;
    }
    USART_IntEnable(pcfg->base, interrupt_enable);
  }

  return 0;
}

static k_timeout_t cfg_timeout(int32_t t)
{
  if (t == SYS_FOREVER_MS) {
    return K_FOREVER;
  }
  if (t == 0) {
    return K_NO_WAIT;
  }
  return SYS_TIMEOUT_MS(t);
}

/*
 * Forward declarations: configure() in its "off" path (frame_clk_freq == 0)
 * tears down DMA / queues and physically gates the BCLK/LRCLK pins, both of
 * which are implemented further down in this file.
 */
static void tx_drop(const struct device *dev, struct i2s_efr32_data *data,
                    const struct i2s_efr32_cfg *cfg);
static void rx_drop(const struct device *dev, struct i2s_efr32_data *data,
                    const struct i2s_efr32_cfg *cfg);

