SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
/*
 * Stop / power-down: drop DMA, gate USART clocks, disable MCLK.
 * Caller must hold data->cfg_lock.
 */
static int configure_power_down(const struct device *dev)
{
  const struct i2s_efr32_cfg *pcfg = dev->config;
  struct i2s_efr32_data *data = dev->data;

  hw_disable_data_irqs(pcfg->base);
  hw_clear_error_irqs(pcfg->base);

  if (data->tx.cfg_valid) {
    tx_drop(dev, data, pcfg);
  }
  if (data->rx.cfg_valid) {
    rx_drop(dev, data, pcfg);
  }

  USART_Enable(pcfg->base, usartDisable);

  data->tx.cfg_valid = false;
  data->rx.cfg_valid = false;
  data->tx.state = I2S_STATE_NOT_READY;
  data->rx.state = I2S_STATE_NOT_READY;

  return i2s_efr32_mco_set(pcfg->mclk_dev, false);
}

static int validate_configure_block_size(const struct i2s_config *cfg)
{
  const uint32_t frame_bytes = ((uint32_t)cfg->word_size / I2S_BITS_PER_BYTE)
                               * (uint32_t)cfg->channels;

  if (cfg->block_size == 0U || frame_bytes == 0U
      || (cfg->block_size % frame_bytes) != 0U
      || (cfg->block_size % I2S_DMA_DATA_SIZE(cfg->word_size)) != 0U) {
    return -EINVAL;
  }
  return 0;
}

static bool tx_rx_cfg_mismatch(const struct i2s_efr32_data *data)
{
  return data->tx.cfg_valid && data->rx.cfg_valid
         && (data->tx.cfg.frame_clk_freq != data->rx.cfg.frame_clk_freq
             || data->tx.cfg.word_size != data->rx.cfg.word_size
             || data->tx.cfg.format != data->rx.cfg.format
             || data->tx.cfg.channels != data->rx.cfg.channels);
}

static int i2s_efr32_configure(const struct device *dev, enum i2s_dir dir, const struct i2s_config *cfg)
{
  const struct i2s_efr32_cfg *pcfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  int err = 0;

  k_mutex_lock(&data->cfg_lock, K_FOREVER);

  if (cfg == NULL || cfg->frame_clk_freq == 0U) {
    err = configure_power_down(dev);
    k_mutex_unlock(&data->cfg_lock);
    return err;
  }

  if (cfg->word_size == 0U) {
    k_mutex_unlock(&data->cfg_lock);
    return -EINVAL;
  }

  if (dir == I2S_DIR_RX && cfg->channels != 2U) {
    k_mutex_unlock(&data->cfg_lock);
    return -EINVAL;
  }

  if (dir == I2S_DIR_TX && cfg->channels != 1U && cfg->channels != 2U) {
    k_mutex_unlock(&data->cfg_lock);
    return -EINVAL;
  }

  if (dir == I2S_DIR_TX && cfg->channels == 1U && !pcfg->has_tx_split) {
    k_mutex_unlock(&data->cfg_lock);
    return -EINVAL;
  }

  err = validate_configure_block_size(cfg);
  if (err < 0) {
    k_mutex_unlock(&data->cfg_lock);
    return err;
  }

  if (dir == I2S_DIR_BOTH) {
    k_mutex_unlock(&data->cfg_lock);
    return -ENOSYS;
  }

  if (dir == I2S_DIR_TX) {
    memcpy(&data->tx.cfg, cfg, sizeof(*cfg));
    data->tx.cfg_valid = true;
    if (tx_cfg_is_mono(cfg)) {
      data->mono_tx_slot = pcfg->mono_tx_default;
    }
  } else {
    memcpy(&data->rx.cfg, cfg, sizeof(*cfg));
    data->rx.cfg_valid = true;
  }

  if (tx_rx_cfg_mismatch(data)) {
    k_mutex_unlock(&data->cfg_lock);
    return -EINVAL;
  }

  err = pinctrl_apply_state(pcfg->pcfg, PINCTRL_STATE_DEFAULT);
  if (err < 0) {
    k_mutex_unlock(&data->cfg_lock);
    return err;
  }

  err = clock_control_on(pcfg->clock_dev, (clock_control_subsys_t)&pcfg->clock_cfg);
  if (err < 0 && err != -EALREADY) {
    k_mutex_unlock(&data->cfg_lock);
    return err;
  }

  err = hw_i2s_apply(dev);
  if (err < 0) {
    k_mutex_unlock(&data->cfg_lock);
    return err;
  }
  data->tx.state = data->tx.cfg_valid ? I2S_STATE_READY : I2S_STATE_NOT_READY;
  data->rx.state = data->rx.cfg_valid ? I2S_STATE_READY : I2S_STATE_NOT_READY;

  err = i2s_efr32_mco_set(pcfg->mclk_dev, true);
  if (err < 0) {
    k_mutex_unlock(&data->cfg_lock);
    return err;
  }

  k_mutex_unlock(&data->cfg_lock);
  return 0;
}

static const struct i2s_config *i2s_efr32_config_get(const struct device *dev, enum i2s_dir dir)
{
  struct i2s_efr32_data *data = dev->data;

  if (dir == I2S_DIR_TX && data->tx.cfg_valid) {
    return &data->tx.cfg;
  }
  if (dir == I2S_DIR_RX && data->rx.cfg_valid) {
    return &data->rx.cfg;
  }
  return NULL;
}

static void i2s_efr32_dma_tx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
                                int status)
{
  const struct device *dev = user_data;
  struct i2s_efr32_data *data = dev->data;
  struct i2s_efr32_stream *tx = &data->tx;
  void *done;

  ARG_UNUSED(dma_dev);
  ARG_UNUSED(channel);

  if (status < 0) {
    tx->state = I2S_STATE_ERROR;
  }

  unsigned int key = irq_lock();
  done = tx->active;

  if (tx->pending != NULL) {
    /*
     * silabs_ldma_append_block() chained the pending block: the
     * LDMA has already auto-started it via LINKLOAD before this
     * callback fires.  Do NOT call dma_stop() -- the channel is
     * still running.
     */
    tx->active = tx->pending;
    tx->pending = NULL;
  } else {
    /*
     * No block was chained -- DMA is now idle.  Call dma_stop()
     * to clear the LDMA driver's internal "busy" atomic so the
     * next dma_config() does not fail with -EBUSY.
     */
    dma_stop(tx->dma.dma_dev, (uint32_t)tx->dma.channel);
    tx->active = NULL;
    tx->dma.busy = false;
    if (tx_path_is_mono(data) && data->tx_silence.busy) {
      dma_stop(data->tx_silence.dma_dev, (uint32_t)data->tx_silence.channel);
      data->tx_silence.busy = false;
    }
  }
  irq_unlock(key);

  if (done != NULL) {
    k_mem_slab_free(tx->cfg.mem_slab, done);
    k_sem_give(&tx->sem);
  }

  i2s_efr32_tx_try_start(dev);
  tx_finish_stopping_if_quiescent(dev);
}

static void i2s_efr32_dma_rx_cb(const struct device *dma_dev, void *user_data, uint32_t channel,
                                int status)
{
  const struct device *dev = user_data;
  const struct i2s_efr32_cfg *cfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  void *done;
  size_t done_len;

  ARG_UNUSED(dma_dev);
  ARG_UNUSED(channel);

  if (status < 0) {
    data->rx.state = I2S_STATE_ERROR;
  }

  dma_stop(cfg->dma_dev, (uint32_t)data->rx.dma.channel);

  unsigned int key = irq_lock();
  done = data->rx.active;
  done_len = data->rx.cfg.block_size;
  data->rx.active = NULL;
  data->rx.dma.busy = false;
  irq_unlock(key);

