SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
  if (done != NULL) {
    if (ring_push(&data->rx.q, done, done_len) < 0) {
      k_mem_slab_free(data->rx.cfg.mem_slab, done);
      data->rx.state = I2S_STATE_ERROR;
    } else {
      k_sem_give(&data->rx.sem);
    }
  }

  i2s_efr32_rx_try_start(dev);
}

static int mono_tx_silence_run(const struct device *dev, size_t len, bool append)
{
  struct i2s_efr32_data *data = dev->data;
  struct i2s_efr32_dma *silence = &data->tx_silence;
  int ret;

  silence->blk_cfg.block_size = len;
  silence->blk_cfg.source_address = tx_silence_src(data, data->tx.cfg.word_size);

  if (append) {
    return silabs_ldma_append_block(silence->dma_dev, (uint32_t)silence->channel,
                                    &silence->dma_cfg);
  }

  ret = dma_config(silence->dma_dev, (uint32_t)silence->channel, &silence->dma_cfg);
  if (ret < 0) {
    return ret;
  }

  ret = dma_start(silence->dma_dev, (uint32_t)silence->channel);
  if (ret < 0) {
    dma_stop(silence->dma_dev, (uint32_t)silence->channel);
    return ret;
  }

  silence->busy = true;
  return 0;
}

static int dma_config_start(const struct i2s_efr32_cfg *cfg,
                            struct i2s_efr32_data *data,
                            struct i2s_efr32_stream *tx,
                            void *blk)
{
  int ret;

  ret = dma_config(tx->dma.dma_dev, (uint32_t)tx->dma.channel,
                   &tx->dma.dma_cfg);
  if (ret < 0) {
    if (tx_path_is_mono(data)) {
      dma_stop(data->tx_silence.dma_dev, (uint32_t)data->tx_silence.channel);
      data->tx_silence.busy = false;
    }
    tx->dma.busy = false;
    tx->active = NULL;
    k_mem_slab_free(tx->cfg.mem_slab, blk);
    k_sem_give(&tx->sem);
    tx->state = I2S_STATE_ERROR;
    return -1;
  }

  ret = dma_start(tx->dma.dma_dev, (uint32_t)tx->dma.channel);
  if (ret < 0) {
    dma_stop(cfg->dma_dev, (uint32_t)tx->dma.channel);
    if (tx_path_is_mono(data)) {
      dma_stop(data->tx_silence.dma_dev, (uint32_t)data->tx_silence.channel);
      data->tx_silence.busy = false;
    }
    tx->dma.busy = false;
    tx->active = NULL;
    k_mem_slab_free(tx->cfg.mem_slab, blk);
    k_sem_give(&tx->sem);
    tx->state = I2S_STATE_ERROR;
    return -1;
  }

  return 0;
}

static void i2s_efr32_tx_try_start(const struct device *dev)
{
  const struct i2s_efr32_cfg *cfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  struct i2s_efr32_stream *tx = &data->tx;
  void *blk = NULL;
  size_t len = 0U;
  int ret;
  unsigned int key;

  if (tx->state != I2S_STATE_RUNNING && tx->state != I2S_STATE_STOPPING) {
    return;
  }

  key = irq_lock();

  if (tx->active == NULL) {
    /*
     * DMA is idle -- pop a block from the ring and perform a full
     * dma_config() + dma_start() cycle.  Cold-start path used by
     * I2S_TRIGGER_START and as fallback when the ring was empty.
     */
    ret = ring_pop(&tx->q, &blk, &len);
    irq_unlock(key);

    if (ret < 0) {
      tx_finish_stopping_if_quiescent(dev);
      return;
    }

    tx->active = blk;
    tx->dma.busy = true;

    tx->dma.blk_cfg.source_address = (uintptr_t)blk;
    tx->dma.blk_cfg.block_size = len;

    if (tx_path_is_mono(data)) {
      ret = mono_tx_silence_run(dev, len, false);
      if (ret < 0) {
        tx->dma.busy = false;
        tx->active = NULL;
        k_mem_slab_free(tx->cfg.mem_slab, blk);
        k_sem_give(&tx->sem);
        tx->state = I2S_STATE_ERROR;
        return;
      }
    }

    ret = dma_config_start(cfg, data, tx, blk);
    if (ret < 0) {
      return;
    }

    /* Immediately try to double-buffer for gapless first transition */
    i2s_efr32_tx_try_start(dev);
    return;
  }

  if (tx->pending != NULL) {
    irq_unlock(key);
    return;
  }

  /*
   * DMA is running and no next block queued yet.  Pop the next block and
   * use silabs_ldma_append_block() to chain it after the current transfer.
   * The LDMA hardware will seamlessly transition via LINKLOAD, eliminating
   * the gap that dma_stop/config/start would introduce.
   */
  ret = ring_pop(&tx->q, &blk, &len);
  if (ret < 0) {
    irq_unlock(key);
    return;
  }

  tx->dma.blk_cfg.source_address = (uintptr_t)blk;
  tx->dma.blk_cfg.block_size = len;

  if (tx_path_is_mono(data)) {
    ret = mono_tx_silence_run(dev, len, true);
    if (ret < 0) {
      irq_unlock(key);
      k_mem_slab_free(tx->cfg.mem_slab, blk);
      k_sem_give(&tx->sem);
      return;
    }
  }

  ret = silabs_ldma_append_block(tx->dma.dma_dev, (uint32_t)tx->dma.channel,
                                 &tx->dma.dma_cfg);
  if (ret == 0) {
    tx->pending = blk;
  }
  irq_unlock(key);

  if (ret < 0) {
    k_mem_slab_free(tx->cfg.mem_slab, blk);
    k_sem_give(&tx->sem);
  }
}

static void i2s_efr32_rx_try_start(const struct device *dev)
{
  const struct i2s_efr32_cfg *cfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  struct i2s_efr32_stream *rx = &data->rx;
  int slab_ret;
  int ret;
  unsigned int key;

  if (rx->state != I2S_STATE_RUNNING) {
    return;
  }

  key = irq_lock();
  if (rx->dma.busy || rx->active != NULL) {
    irq_unlock(key);
    return;
  }
  irq_unlock(key);

  slab_ret = k_mem_slab_alloc(rx->cfg.mem_slab, &rx->active, K_NO_WAIT);
  if (slab_ret < 0) {
    rx->state = I2S_STATE_ERROR;
    return;
  }

  rx->dma.busy = true;
  rx->dma.blk_cfg.dest_address = (uintptr_t)rx->active;
  rx->dma.blk_cfg.block_size = rx->cfg.block_size;

  ret = dma_config(rx->dma.dma_dev, (uint32_t)rx->dma.channel, &rx->dma.dma_cfg);
  if (ret < 0) {
    rx->dma.busy = false;
    k_mem_slab_free(rx->cfg.mem_slab, rx->active);
    rx->active = NULL;
    rx->state = I2S_STATE_ERROR;
    return;
  }

  ret = dma_start(rx->dma.dma_dev, (uint32_t)rx->dma.channel);
  if (ret < 0) {
    dma_stop(cfg->dma_dev, (uint32_t)rx->dma.channel);
    rx->dma.busy = false;
    k_mem_slab_free(rx->cfg.mem_slab, rx->active);
    rx->active = NULL;
    rx->state = I2S_STATE_ERROR;
  }
}

static int i2s_efr32_read(const struct device *dev, void **mem_block, size_t *size)
{
  struct i2s_efr32_data *data = dev->data;
  void *blk;
  size_t len;
  int ret;

  if (!data->rx.cfg_valid) {
    return -EIO;
  }

  ret = k_sem_take(&data->rx.sem, cfg_timeout(data->rx.cfg.timeout));
  if (ret < 0) {
    return ret;
  }

  unsigned int key = irq_lock();

