SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
  ret = ring_pop(&data->rx.q, &blk, &len);
  irq_unlock(key);

  if (ret < 0) {
    return -EIO;
  }

  *mem_block = blk;
  *size = len;
  return 0;
}

static int i2s_efr32_write(const struct device *dev, void *mem_block, size_t size)
{
  struct i2s_efr32_data *data = dev->data;
  int ret;

  if (!data->tx.cfg_valid) {
    return -EIO;
  }
  if (data->tx.state != I2S_STATE_READY && data->tx.state != I2S_STATE_RUNNING) {
    return -EIO;
  }
  const uint32_t tx_frame_bytes =
    ((uint32_t)data->tx.cfg.word_size / I2S_BITS_PER_BYTE)
    * (uint32_t)data->tx.cfg.channels;

  if (size == 0U || size > data->tx.cfg.block_size || tx_frame_bytes == 0U
      || (size % tx_frame_bytes) != 0U
      || (size % I2S_DMA_DATA_SIZE(data->tx.cfg.word_size)) != 0U) {
    return -EINVAL;
  }

  ret = k_sem_take(&data->tx.sem, cfg_timeout(data->tx.cfg.timeout));
  if (ret < 0) {
    return ret;
  }

  unsigned int key = irq_lock();

  ret = ring_push(&data->tx.q, mem_block, size);
  irq_unlock(key);

  if (ret < 0) {
    k_sem_give(&data->tx.sem);
    return -ENOMEM;
  }

  if (data->tx.state == I2S_STATE_RUNNING) {
    i2s_efr32_tx_try_start(dev);
  }

  return 0;
}

static void tx_drop(const struct device *dev, struct i2s_efr32_data *data,
                    const struct i2s_efr32_cfg *cfg)
{
  void *blk;
  size_t len;

  ARG_UNUSED(dev);

  if (data->tx.dma.busy) {
    dma_stop(cfg->dma_dev, (uint32_t)data->tx.dma.channel);
    data->tx.dma.busy = false;
  }
  if (tx_path_is_mono(data) && data->tx_silence.busy) {
    dma_stop(cfg->dma_dev, (uint32_t)data->tx_silence.channel);
    data->tx_silence.busy = false;
  }
  if (data->tx.pending != NULL) {
    k_mem_slab_free(data->tx.cfg.mem_slab, data->tx.pending);
    k_sem_give(&data->tx.sem);
    data->tx.pending = NULL;
  }
  if (data->tx.active != NULL) {
    k_mem_slab_free(data->tx.cfg.mem_slab, data->tx.active);
    k_sem_give(&data->tx.sem);
    data->tx.active = NULL;
  }

  while (ring_pop(&data->tx.q, &blk, &len) == 0) {
    k_mem_slab_free(data->tx.cfg.mem_slab, blk);
    k_sem_give(&data->tx.sem);
  }
}

static void rx_drop(const struct device *dev, struct i2s_efr32_data *data,
                    const struct i2s_efr32_cfg *cfg)
{
  void *blk;
  size_t len;

  ARG_UNUSED(dev);

  if (data->rx.dma.busy) {
    dma_stop(cfg->dma_dev, (uint32_t)data->rx.dma.channel);
    data->rx.dma.busy = false;
  }
  if (data->rx.active != NULL) {
    k_mem_slab_free(data->rx.cfg.mem_slab, data->rx.active);
    data->rx.active = NULL;
  }

  while (ring_pop(&data->rx.q, &blk, &len) == 0) {
    k_mem_slab_free(data->rx.cfg.mem_slab, blk);
  }
  while (k_sem_take(&data->rx.sem, K_NO_WAIT) == 0) {
  }
}

static int trigger_start(const struct device *dev, enum i2s_dir dir,
                         struct i2s_efr32_data *data)
{
  if (dir == I2S_DIR_TX && data->tx.cfg_valid) {
    if (data->tx.state != I2S_STATE_READY) {
      return -EINVAL;
    }
    data->tx.state = I2S_STATE_RUNNING;
    i2s_efr32_tx_try_start(dev);
  }
  if (dir == I2S_DIR_RX && data->rx.cfg_valid) {
    if (data->rx.state != I2S_STATE_READY) {
      return -EINVAL;
    }
    data->rx.state = I2S_STATE_RUNNING;
    i2s_efr32_rx_try_start(dev);
  }
  return 0;
}

static int trigger_stop(const struct device *dev, enum i2s_dir dir,
                        struct i2s_efr32_data *data, const struct i2s_efr32_cfg *pcfg)
{
  if (dir == I2S_DIR_TX && data->tx.cfg_valid) {
    if (data->tx.state != I2S_STATE_RUNNING) {
      return -EINVAL;
    }
    if (data->tx.active == NULL && data->tx.pending == NULL && data->tx.q.count == 0U) {
      data->tx.state = I2S_STATE_READY;
    } else {
      data->tx.state = I2S_STATE_STOPPING;
      i2s_efr32_tx_try_start(dev);
      tx_finish_stopping_if_quiescent(dev);
    }
  }
  if (dir == I2S_DIR_RX && data->rx.cfg_valid) {
    if (data->rx.state != I2S_STATE_RUNNING) {
      return -EINVAL;
    }
    data->rx.state = I2S_STATE_STOPPING;
    if (data->rx.dma.busy) {
      dma_stop(pcfg->dma_dev, (uint32_t)data->rx.dma.channel);
      data->rx.dma.busy = false;
    }
    rx_drop(dev, data, pcfg);
    data->rx.state = I2S_STATE_READY;
  }
  return 0;
}

static int trigger_drain(const struct device *dev, enum i2s_dir dir,
                         struct i2s_efr32_data *data)
{
  if (dir == I2S_DIR_TX && data->tx.cfg_valid) {
    if (data->tx.state != I2S_STATE_RUNNING) {
      return -EINVAL;
    }
    data->tx.state = I2S_STATE_STOPPING;
    i2s_efr32_tx_try_start(dev);
    tx_finish_stopping_if_quiescent(dev);
    return 0;
  }
  return -EINVAL;
}

static int trigger_drop(const struct device *dev, enum i2s_dir dir,
                        struct i2s_efr32_data *data, const struct i2s_efr32_cfg *pcfg)
{
  hw_disable_data_irqs(pcfg->base);
  if (dir == I2S_DIR_TX || dir == I2S_DIR_BOTH) {
    tx_drop(dev, data, pcfg);
    data->tx.state = data->tx.cfg_valid ? I2S_STATE_READY : I2S_STATE_NOT_READY;
  }
  if (dir == I2S_DIR_RX || dir == I2S_DIR_BOTH) {
    rx_drop(dev, data, pcfg);
    data->rx.state = data->rx.cfg_valid ? I2S_STATE_READY : I2S_STATE_NOT_READY;
  }
  return 0;
}

static int trigger_prepare(struct i2s_efr32_data *data)
{
  if (data->tx.state == I2S_STATE_ERROR || data->rx.state == I2S_STATE_ERROR) {
    data->tx.state = data->tx.cfg_valid ? I2S_STATE_READY : I2S_STATE_NOT_READY;
    data->rx.state = data->rx.cfg_valid ? I2S_STATE_READY : I2S_STATE_NOT_READY;
    return 0;
  }
  return -EINVAL;
}

static int i2s_efr32_trigger(const struct device *dev, enum i2s_dir dir,
                             enum i2s_trigger_cmd cmd)
{
  const struct i2s_efr32_cfg *pcfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  int err = 0;

  k_mutex_lock(&data->cfg_lock, K_FOREVER);

  switch (cmd) {
    case I2S_TRIGGER_START:
      err = trigger_start(dev, dir, data);
      break;
    case I2S_TRIGGER_STOP:
      err = trigger_stop(dev, dir, data, pcfg);
      break;
    case I2S_TRIGGER_DRAIN:
      err = trigger_drain(dev, dir, data);
      break;
    case I2S_TRIGGER_DROP:
      err = trigger_drop(dev, dir, data, pcfg);
      break;
    case I2S_TRIGGER_PREPARE:
      err = trigger_prepare(data);
      break;
    default:
      err = -EINVAL;
      break;
  }

  k_mutex_unlock(&data->cfg_lock);
  return err;
}

