SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
static void i2s_efr32_isr(const void *arg)
{
  const struct device *dev = arg;
  const struct i2s_efr32_cfg *cfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  uint32_t flags = USART_IntGet(cfg->base);

  if (flags & USART_IF_TXUF) {
    /*
     * TX underflow at a block boundary is expected when the CPU
     * cannot chain the next DMA descriptor in time.  With gapless
     * DMA chaining this should rarely occur, but if it does, just
     * clear the flag -- the DMA callback will still fire and can
     * continue streaming.  Making this non-fatal prevents the
     * stream from being killed at every block boundary at high
     * sample rates (>= 16 kHz).
     */
    USART_IntClear(cfg->base, USART_IF_TXUF);
  }

  if (flags & USART_IF_RXOF) {
    data->rx.state = I2S_STATE_ERROR;
    dma_stop(cfg->dma_dev, (uint32_t)data->rx.dma.channel);
    data->rx.dma.busy = false;
    USART_IntClear(cfg->base, USART_IF_RXOF);
  }
}

static int i2s_efr32_init(const struct device *dev)
{
  const struct i2s_efr32_cfg *cfg = dev->config;
  struct i2s_efr32_data *data = dev->data;
  USART_TypeDef *base = cfg->base;
  int err;

  k_mutex_init(&data->cfg_lock);
  ring_init(&data->tx.q, TX_RING_SIZE);
  ring_init(&data->rx.q, RX_RING_SIZE);
  k_sem_init(&data->tx.sem, TX_RING_SIZE, TX_RING_SIZE);
  k_sem_init(&data->rx.sem, 0, RX_RING_SIZE);

  if (!device_is_ready(cfg->dma_dev)) {
    return -ENODEV;
  }

  /* USART register access faults if the peripheral clock is still gated (see uart_silabs_init). */
  err = clock_control_on(cfg->clock_dev, (clock_control_subsys_t)&cfg->clock_cfg);
  if (err < 0 && err != -EALREADY) {
    return err;
  }

  data->tx.dma.dma_dev = cfg->dma_dev;
  data->tx_silence.dma_dev = cfg->dma_dev;

  if (cfg->has_tx_split) {
    data->tx_silence.channel = dma_request_channel(cfg->dma_dev, NULL);
    if (data->tx_silence.channel < 0) {
      return -ENODEV;
    }

    data->tx.dma.channel = dma_request_channel(cfg->dma_dev, NULL);
    if (data->tx.dma.channel < 0) {
      dma_release_channel(cfg->dma_dev, (uint32_t)data->tx_silence.channel);
      return -ENODEV;
    }
  } else {
    data->tx_silence.channel = -1;
    data->tx.dma.channel = dma_request_channel(cfg->dma_dev, NULL);
    if (data->tx.dma.channel < 0) {
      return -ENODEV;
    }
  }

  data->rx.dma.dma_dev = cfg->dma_dev;
  data->rx.dma.channel = dma_request_channel(cfg->dma_dev, NULL);
  if (data->rx.dma.channel < 0) {
    dma_release_channel(cfg->dma_dev, (uint32_t)data->tx.dma.channel);
    if (cfg->has_tx_split) {
      dma_release_channel(cfg->dma_dev, (uint32_t)data->tx_silence.channel);
    }
    return -ENODEV;
  }

  /*
   * Provisional DMA defaults using I2S_DMA_DATA_SIZE(16U) == 2 bytes.
   * apply_dma_xfer_size() rewrites these from the actual word_size when
   * configure() runs; the 16U here is just a safe placeholder to keep
   * the LDMA struct self-consistent until then.
   */
  memset(&data->tx.dma.dma_cfg, 0, sizeof(data->tx.dma.dma_cfg));
  data->tx.dma.dma_cfg.dma_slot = cfg->dma_txbl_slot;
  data->tx.dma.dma_cfg.channel_direction = MEMORY_TO_PERIPHERAL;
  data->tx.dma.dma_cfg.source_data_size = I2S_DMA_DATA_SIZE(16U);
  data->tx.dma.dma_cfg.dest_data_size = I2S_DMA_DATA_SIZE(16U);
  data->tx.dma.dma_cfg.source_burst_length = I2S_DMA_DATA_SIZE(16U);
  data->tx.dma.dma_cfg.dest_burst_length = I2S_DMA_DATA_SIZE(16U);
  data->tx.dma.dma_cfg.head_block = &data->tx.dma.blk_cfg;
  data->tx.dma.dma_cfg.user_data = (void *)dev;
  data->tx.dma.dma_cfg.dma_callback = i2s_efr32_dma_tx_cb;
  data->tx.dma.dma_cfg.complete_callback_en = I2S_DMA_COMPLETE_CB_ENABLED;
  data->tx.dma.dma_cfg.channel_priority = I2S_DMA_CHANNEL_PRIORITY;
  memset(&data->tx.dma.blk_cfg, 0, sizeof(data->tx.dma.blk_cfg));
  /* TX DMA writes to TXDOUBLE: a 32-bit access enqueues two 16-bit
   * USART frames atomically (low half shifts out first); a 16-bit
   * access enqueues one frame.  apply_dma_xfer_size() picks 2 or 4
   * bytes per trigger based on word_size.
   */
  data->tx.dma.blk_cfg.dest_address = (uintptr_t)&base->TXDOUBLE;
  data->tx.dma.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_INCREMENT;
  data->tx.dma.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;

  if (cfg->has_tx_split) {
    memset(&data->tx_silence.dma_cfg, 0, sizeof(data->tx_silence.dma_cfg));
    data->tx_silence.dma_cfg.dma_slot = cfg->dma_txbl_slot;
    data->tx_silence.dma_cfg.channel_direction = MEMORY_TO_PERIPHERAL;
    data->tx_silence.dma_cfg.source_data_size = I2S_DMA_DATA_SIZE(16U);
    data->tx_silence.dma_cfg.dest_data_size = I2S_DMA_DATA_SIZE(16U);
    data->tx_silence.dma_cfg.source_burst_length = I2S_DMA_DATA_SIZE(16U);
    data->tx_silence.dma_cfg.dest_burst_length = I2S_DMA_DATA_SIZE(16U);
    data->tx_silence.dma_cfg.head_block = &data->tx_silence.blk_cfg;
    data->tx_silence.dma_cfg.channel_priority = I2S_DMA_CHANNEL_PRIORITY;
    data->tx_silence.dma_cfg.complete_callback_en = 0U;
    memset(&data->tx_silence.blk_cfg, 0, sizeof(data->tx_silence.blk_cfg));
    data->tx_silence.blk_cfg.dest_address = (uintptr_t)&base->TXDOUBLE;
    data->tx_silence.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
    data->tx_silence.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
  }

  /* See note above; mirror placeholder for RX. */
  memset(&data->rx.dma.dma_cfg, 0, sizeof(data->rx.dma.dma_cfg));
  data->rx.dma.dma_cfg.dma_slot = cfg->dma_rx_slot;
  data->rx.dma.dma_cfg.channel_direction = PERIPHERAL_TO_MEMORY;
  data->rx.dma.dma_cfg.source_data_size = I2S_DMA_DATA_SIZE(16U);
  data->rx.dma.dma_cfg.dest_data_size = I2S_DMA_DATA_SIZE(16U);
  data->rx.dma.dma_cfg.source_burst_length = I2S_DMA_DATA_SIZE(16U);
  data->rx.dma.dma_cfg.dest_burst_length = I2S_DMA_DATA_SIZE(16U);
  data->rx.dma.dma_cfg.head_block = &data->rx.dma.blk_cfg;
  data->rx.dma.dma_cfg.user_data = (void *)dev;
  data->rx.dma.dma_cfg.dma_callback = i2s_efr32_dma_rx_cb;
  data->rx.dma.dma_cfg.complete_callback_en = I2S_DMA_COMPLETE_CB_ENABLED;
  data->rx.dma.dma_cfg.channel_priority = I2S_DMA_CHANNEL_PRIORITY;
  memset(&data->rx.dma.blk_cfg, 0, sizeof(data->rx.dma.blk_cfg));
  data->rx.dma.blk_cfg.source_address = (uintptr_t)&base->RXDOUBLE;
  data->rx.dma.blk_cfg.source_addr_adj = DMA_ADDR_ADJ_NO_CHANGE;
  data->rx.dma.blk_cfg.dest_addr_adj = DMA_ADDR_ADJ_INCREMENT;

