SiliconLabsSoftware/zephyr/drivers/i2s/i2s_silabs_efr32_usart.c
  hw_disable_data_irqs(base);
  hw_clear_error_irqs(base);
  USART_IntEnable(base, USART_IF_RXOF | USART_IF_TXUF);

  cfg->irq_connect(dev);
  return 0;
}

static DEVICE_API(i2s, i2s_efr32_driver_api) = {
  .configure = i2s_efr32_configure,
  .config_get = i2s_efr32_config_get,
  .read = i2s_efr32_read,
  .write = i2s_efr32_write,
  .trigger = i2s_efr32_trigger,
};

#define I2S_EFR32_IRQ_CONNECT(idx)                                                         \
  static void i2s_efr32_irq_connect_##idx(const struct device *dev)                        \
  {                                                                                        \
    ARG_UNUSED(dev);                                                                       \
    IRQ_CONNECT(DT_INST_IRQ_BY_NAME(idx, rx, irq), DT_INST_IRQ_BY_NAME(idx, rx, priority), \
                i2s_efr32_isr, DEVICE_DT_INST_GET(idx), 0);                                \
    IRQ_CONNECT(DT_INST_IRQ_BY_NAME(idx, tx, irq), DT_INST_IRQ_BY_NAME(idx, tx, priority), \
                i2s_efr32_isr, DEVICE_DT_INST_GET(idx), 0);                                \
    irq_enable(DT_INST_IRQ_BY_NAME(idx, rx, irq));                                         \
    irq_enable(DT_INST_IRQ_BY_NAME(idx, tx, irq));                                         \
  }

#define I2S_EFR32_MCLK_DEV(idx)                            \
  COND_CODE_1(DT_INST_NODE_HAS_PROP(idx, silabs_mclk_out), \
              (DEVICE_DT_GET(DT_INST_PHANDLE(idx, silabs_mclk_out))), (NULL))

#define I2S_EFR32_HAS_TXBL_DMA(idx) \
  (DT_INST_DMAS_HAS_NAME(idx, txbl) || DT_INST_DMAS_HAS_NAME(idx, tx))

#define I2S_EFR32_HAS_TXBLRIGHT_DMA(idx) \
  (DT_INST_DMAS_HAS_NAME(idx, txblright) || DT_INST_DMAS_HAS_NAME(idx, tx_right))

#define I2S_EFR32_HAS_TX_SPLIT(idx) \
  (I2S_EFR32_HAS_TXBL_DMA(idx) && I2S_EFR32_HAS_TXBLRIGHT_DMA(idx))

#define I2S_EFR32_TXBL_DMA_NAME(idx) \
  COND_CODE_1(DT_INST_DMAS_HAS_NAME(idx, txbl), (txbl), (tx))

#define I2S_EFR32_TXBLRIGHT_DMA_NAME(idx) \
  COND_CODE_1(DT_INST_DMAS_HAS_NAME(idx, txblright), (txblright), (tx_right))

#define I2S_EFR32_DMA_TXBL_SLOT(idx)                                                      \
  SILABS_LDMA_REQSEL_TO_SLOT(DT_INST_DMAS_CELL_BY_NAME(idx, I2S_EFR32_TXBL_DMA_NAME(idx), \
                                                       slot))

#define I2S_EFR32_DMA_TXBLRIGHT_SLOT(idx)                                                    \
  COND_CODE_1(DT_INST_DMAS_HAS_NAME(idx, txblright),                                         \
              (SILABS_LDMA_REQSEL_TO_SLOT(DT_INST_DMAS_CELL_BY_NAME(idx, txblright, slot))), \
              (COND_CODE_1(DT_INST_DMAS_HAS_NAME(idx, tx_right),                             \
                           (SILABS_LDMA_REQSEL_TO_SLOT(DT_INST_DMAS_CELL_BY_NAME(            \
                                                         idx, tx_right, slot))),             \
                           (0U))))

#define I2S_EFR32_MONO_TX_DEFAULT(idx)                         \
  COND_CODE_1(DT_INST_NODE_HAS_PROP(idx, silabs_mono_tx_slot), \
              (DT_INST_ENUM_IDX(idx, silabs_mono_tx_slot)), (I2S_EFR32_MONO_TX_SLOT_RIGHT))

#define I2S_EFR32_DEFINE(idx)                                                               \
  I2S_EFR32_IRQ_CONNECT(idx);                                                               \
  PINCTRL_DT_INST_DEFINE(idx);                                                              \
  static const struct i2s_efr32_cfg i2s_efr32_cfg_##idx = {                                 \
    .base = (USART_TypeDef *)DT_INST_REG_ADDR(idx),                                         \
    .clock_dev = DEVICE_DT_GET(DT_INST_CLOCKS_CTLR(idx)),                                   \
    .clock_cfg = SILABS_DT_INST_CLOCK_CFG(idx),                                             \
    .pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(idx),                                            \
    .irq_connect = i2s_efr32_irq_connect_##idx,                                             \
    .dma_dev = DEVICE_DT_GET(DT_INST_DMAS_CTLR_BY_NAME(idx, I2S_EFR32_TXBL_DMA_NAME(idx))), \
    .dma_txbl_slot = I2S_EFR32_DMA_TXBL_SLOT(idx),                                          \
    .dma_txblright_slot = I2S_EFR32_DMA_TXBLRIGHT_SLOT(idx),                                \
    .dma_rx_slot = SILABS_LDMA_REQSEL_TO_SLOT(DT_INST_DMAS_CELL_BY_NAME(idx, rx, slot)),    \
    .mclk_dev = I2S_EFR32_MCLK_DEV(idx),                                                    \
    .has_tx_split = I2S_EFR32_HAS_TX_SPLIT(idx),                                            \
    .mono_tx_default = I2S_EFR32_MONO_TX_DEFAULT(idx),                                      \
  };                                                                                        \
  static struct i2s_efr32_data i2s_efr32_data_##idx;                                        \
  DEVICE_DT_INST_DEFINE(idx, i2s_efr32_init, NULL, &i2s_efr32_data_##idx,                   \
                        &i2s_efr32_cfg_##idx, POST_KERNEL, CONFIG_I2S_INIT_PRIORITY,        \
                        &i2s_efr32_driver_api);

DT_INST_FOREACH_STATUS_OKAY(I2S_EFR32_DEFINE)
